INSERT INTO `eb_res` ( `name`, `url`, `descr`, `is_enable`, `create_date`, `create_time`, `creator_id`, `modify_date`, `modify_time`, `modifier_id` )
VALUES
        ( '资产管理', '', '资产管理(Sidebar)', '1', '20190131', '120000', 0, '20190131', '120000', 0 ),
        ( '资产查询', 'asset/asset.page', '进入资产查询页面', '1', '20190131', '120000', 0, '20190131', '120000', 0 ),
        ( '获取 资产列表', 'asset/get-assets.json', '获取资产列表(分页)', '1', '20190131', '120000', 0, '20190131', '120000', 0 ),
        ('资产详情', 'asset/asset-detail.page', '进入资产详情页面', '1', '20190131', '120000', 0, '20190131', '120000', 0 ),
        ( '资产创建', 'asset/to-create-asset.page', '进入资产创建页面', '1', '20190131', '120000', 0, '20190131', '120000', 0 ),
        ( '创建 资产信息', 'asset/create-asset.json', '创建资产信息', '1', '20190131', '120000', 0, '20190131', '120000', 0 ),
        ('资产修改', 'asset/to-update-asset.page', '进入资产修改页面', '1', '20190131', '120000', 0, '20190131', '120000', 0 ),
        ('修改 资产信息', 'asset/update-asset.json', '修改资产信息', '1', '20190131', '120000', 0, '20190131', '120000', 0 ),
        ('删除 资产信息', 'asset/delete-asset.json', '删除资产信息', '1', '20190131', '120000', 0, '20190131', '120000', 0 ),
        ('导出Excel 资产信息', 'asset/export-asset-excel.json', '导出资产信息为Excel', '1', '20190131', '120000', 0, '20190131', '120000', 0 ),
        ('下载 资产附件', 'asset/download-asset-attach.json', '下载资产附件', '1', '20190131', '120000', 0, '20190131', '120000', 0 ),
        ('上传 资产附件', 'asset/upload-asset-attach.json', '上传资产附件', '1', '20190131', '120000', 0, '20190131', '120000', 0),
        ('删除 资产附件', 'asset/delete-asset-attach.json', '删除资产附件', '1', '20190131', '120000', 0, '20190131', '120000', 0);
INSERT INTO `eb_power` ( `code`, `name`, `notes`, `type`, `is_enable`, `create_date`, `create_time`, `creator_id`, `modify_date`, `modify_time`, `modifier_id` )
VALUES
        ( 'MGT00426', '资产查询', '资产管理-tag', '02', '1', '20190131', '120000', 0, '20190131', '120000', 0 ),
        ( 'MGT00427', '资产创建', '创建资产', '02', '1', '20190131', '120000', 0, '20190131', '120000', 0 ),
        ( 'MGT00428', '资产修改', '修改资产', '02', '1', '20190131', '120000', 0, '20190131', '120000', 0 ),
        ( 'MGT00429', '资产删除', '删除资产', '02', '1', '20190131', '120000', 0, '20190131', '120000', 0 ),
        ( 'MGT00430', 'Excel', '导出资产信息为Excel', '02', '1', '20190131', '120000', 0, '20190131', '120000', 0 ),
        ( 'MGT00431', '资产附件', '资产附件', '02', '1', '20190131', '120000', 0, '20190131', '120000', 0 );
INSERT INTO `eb_power_group` ( `group_code`, `group_name`, `parent_group_code`, `power_code`, `is_enable`, `create_date`, `create_time`, `creator_id`, `modify_date`, `modify_time`, `modifier_id` )
VALUES
        ( 'MGTPG255', '资产管理', '', '', '1', '20190131', '120000', 0, '20190131', '120000', 0 ),
        ( 'MGTPG256', '资产查询', 'MGTPG255', 'MGT00426', '1', '20190131', '120000', 0, '20190131', '120000', 0 ),
        ( 'MGTPG256', '资产查询', 'MGTPG255', 'MGT00427', '1', '20190131', '120000', 0, '20190131', '120000', 0 ),
        ( 'MGTPG256', '资产查询', 'MGTPG255', 'MGT00428', '1', '20190131', '120000', 0, '20190131', '120000', 0 ),
        ( 'MGTPG256', '资产查询', 'MGTPG255', 'MGT00429', '1', '20190131', '120000', 0, '20190131', '120000', 0 ),
        ( 'MGTPG256', '资产查询', 'MGTPG255', 'MGT00430', '1', '20190131', '120000', 0, '20190131', '120000', 0 ),
        ( 'MGTPG256', '资产查询', 'MGTPG255', 'MGT00431', '1', '20190131', '120000', 0, '20190131', '120000', 0 );
INSERT INTO `eb_r_res_power` ( `res_id`, `power_code`, `is_enable`, `create_date`, `create_time`, `creator_id`, `modify_date`, `modify_time`, `modifier_id` )
VALUES
        -- 资产查询
        ( 10533, 'MGT00426', '1', '20190131', '120000', 0, '20190131', '120000', 0 ),        -- 资产列表页面
        ( 10534, 'MGT00426', '1', '20190131', '120000', 0, '20190131', '120000', 0 ),        -- 获取资产列表
        ( 10535, 'MGT00426', '1', '20190131', '120000', 0, '20190131', '120000', 0 ),        -- 资产详情页面
        -- 资产创建
        ( 10536, 'MGT00427', '1', '20190131', '120000', 0, '20190131', '120000', 0 ),        -- 资产创建页面
        ( 10537, 'MGT00427', '1', '20190131', '120000', 0, '20190131', '120000', 0 ),        -- 创建资产
        -- 资产修改
        ( 10538, 'MGT00428', '1', '20190131', '120000', 0, '20190131', '120000', 0 ),        -- 资产修改页面
        ( 10539, 'MGT00428', '1', '20190131', '120000', 0, '20190131', '120000', 0 ),        -- 修改资产
        -- 资产删除
        ( 10540, 'MGT00429', '1', '20190131', '120000', 0, '20190131', '120000', 0 ),        -- 修改资产
        -- 导出Excel
        ( 10541, 'MGT00430', '1', '20190131', '120000', 0, '20190131', '120000', 0 ),
        -- 资产附件
        ( 10542, 'MGT00431', '1', '20190131', '120000', 0, '20190131', '120000', 0 ),        -- 下载资产附件
        ( 10543, 'MGT00431', '1', '20190131', '120000', 0, '20190131', '120000', 0 ),        -- 上传资产附件
        ( 10544, 'MGT00431', '1', '20190131', '120000', 0, '20190131', '120000', 0 );        -- 删除资产附件
INSERT INTO `eb_menu_tree` ( `res_id`, `tree_code`, `descr`, `is_enable`, `create_date`, `create_time`, `creator_id`, `creator`, `modify_date`, `modify_time`, `modifier_id`, `modifier`, `remark` )
VALUES
        ( 10532, '50', '资产管理', '1', '20190131', '120000', 0, '', '20190131', '120000', 0, '', NULL ),
        ( 10533, '5001', '资产查询', '1', '20190131', '120000', 0, '', '20190131', '120000', 0, '', NULL ),
        ( 10536, '5002', '资产创建', '1', '20190131', '120000', 0, '', '20190131', '120000', 0, '', NULL );
